---
type: FamilyParameter
namespace: Autodesk.Revit.DB
version: 2024
members: 14
tags: [revit-api, class]
---

# FamilyParameter

`Autodesk.Revit.DB.FamilyParameter` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetUnitTypeId | — | `public ForgeTypeId GetUnitTypeId ()` |
| Property | AssociatedParameters | — | `public ParameterSet AssociatedParameters { get ; }` |
| Property | CanAssignFormula | — | `public bool CanAssignFormula { get ; }` |
| Property | Definition | — | `public Definition Definition { get ; }` |
| Property | Formula | — | `public string Formula { get ; }` |
| Property | GUID | 2012 | `public Guid GUID { get ; }` |
| Property | Id | 2011 | `public ElementId Id { get ; }` |
| Property | IsDeterminedByFormula | — | `public bool IsDeterminedByFormula { get ; }` |
| Property | IsInstance | — | `public bool IsInstance { get ; }` |
| Property | IsReadOnly | — | `public override bool IsReadOnly { get ; }` |
| Property | IsReporting | 2011 | `public bool IsReporting { get ; }` |
| Property | IsShared | 2014 | `public bool IsShared { get ; }` |
| Property | StorageType | — | `public StorageType StorageType { get ; }` |
| Property | UserModifiable | 2015 | `public bool UserModifiable { get ; }` |